Examinator/src/Documents/НаполнениеБиблиотекиПользователейСУО/НаполнениеБиблиотекиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаполнениеБиблиотекиПользователейСУО</name>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.ЛитератураСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеКнигиСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлектронныеРесурсы</name>
    <attributes>
      <name>ЭлектронныйРесурс</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/СотрудникиСУО/СотрудникиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиСУО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеПредприятия</name>
    <type>
      <types>CatalogRef.ПодразделенияПредприятияСУО</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиСУО</types>
    </type>
  </resources>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/БиблиотекаПользователейСУО/БиблиотекаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Библиотека</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.СхемыМероприятийСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/УчебныеГруппыСУО/УчебныеГруппыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеГруппыСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Documents/НаполнениеБиблиотекиПользователейСУО/ManagerModule.bsl
Функция ПользователиДокумента(НаполнениеБиблиотеки) Экспорт
	
	Если ТипЗнч(НаполнениеБиблиотеки) = Тип("ДокументСсылка.НаполнениеБиблиотекиПользователейСУО") Тогда
		
		// МассивПользователей
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУОПользователи.Пользователь
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.Пользователи КАК НаполнениеБиблиотекиПользователейСУОПользователи
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУОПользователи.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивПользователей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
		
		// МассивУчебныхГрупп
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУОУчебныеГруппы.УчебнаяГруппа
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.УчебныеГруппы КАК НаполнениеБиблиотекиПользователейСУОУчебныеГруппы
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУОУчебныеГруппы.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивУчебныхГрупп = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УчебнаяГруппа");
		
		// МассивДолжностей
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУОДолжности.Должность
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.Должности КАК НаполнениеБиблиотекиПользователейСУОДолжности
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУОДолжности.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивДолжностей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Должность");
		
		// МассивОрганизаций
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУООрганизации.Организация
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.Организации КАК НаполнениеБиблиотекиПользователейСУООрганизации
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУООрганизации.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
		
		// МассивПодразделенийОрганизаций
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУООрганизации.ПодразделениеОрганизации
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.Организации КАК НаполнениеБиблиотекиПользователейСУООрганизации
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУООрганизации.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивПодразделенийОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПодразделениеОрганизации");
		
		// МассивПодразделенийПредприятия
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаполнениеБиблиотекиПользователейСУОПодразделенияПредприятия.ПодразделениеПредприятия
			|ИЗ
			|	Документ.НаполнениеБиблиотекиПользователейСУО.ПодразделенияПредприятия КАК НаполнениеБиблиотекиПользователейСУОПодразделенияПредприятия
			|ГДЕ
			|	НаполнениеБиблиотекиПользователейСУОПодразделенияПредприятия.Ссылка = &НаполнениеБиблиотеки";
		
		Запрос.УстановитьПараметр("НаполнениеБиблиотеки", НаполнениеБиблиотеки);
		
		МассивПодразделенийПредприятия = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПодразделениеПредприятия");
		
	Иначе
		
		МассивПользователей = НаполнениеБиблиотеки.Пользователи.ВыгрузитьКолонку("Пользователь");
		МассивУчебныхГрупп = НаполнениеБиблиотеки.УчебныеГруппы.ВыгрузитьКолонку("УчебнаяГруппа");
		МассивДолжностей = НаполнениеБиблиотеки.Должности.ВыгрузитьКолонку("Должность");
		МассивОрганизаций = НаполнениеБиблиотеки.Организации.ВыгрузитьКолонку("Организация");
		МассивПодразделенийОрганизаций = НаполнениеБиблиотеки.Организации.ВыгрузитьКолонку("ПодразделениеОрганизации");
		МассивПодразделенийПредприятия = НаполнениеБиблиотеки.ПодразделенияПредприятия.ВыгрузитьКолонку("ПодразделениеПредприятия");
		
	КонецЕсли;
	
	// Учебные группы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчебныеГруппыСУОСостав.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
		|ГДЕ
		|	УчебныеГруппыСУОСостав.Ссылка В(&УчебныеГруппы)";

	Запрос.УстановитьПараметр("УчебныеГруппы", МассивУчебныхГрупп);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если МассивПользователей.Найти(ВыборкаДетальныеЗаписи.Пользователь) = Неопределено Тогда
			МассивПользователей.Добавить(ВыборкаДетальныеЗаписи.Пользователь);
		КонецЕсли;
		
	КонецЦикла;
	
	// Сотрудники
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСУОСрезПоследних.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СотрудникиСУО.СрезПоследних КАК СотрудникиСУОСрезПоследних
		|ГДЕ
		|	СотрудникиСУОСрезПоследних.Уволен = ЛОЖЬ
		|	И (СотрудникиСУОСрезПоследних.Должность В (&Должности)
		|			ИЛИ СотрудникиСУОСрезПоследних.ПодразделениеПредприятия В (&ПодразделенияПредприятия)
		|			ИЛИ СотрудникиСУОСрезПоследних.ПодразделениеОрганизации В (&ПодразделенияОрганизаций)
		|			ИЛИ СотрудникиСУОСрезПоследних.Организация В (&Организации))";

	Запрос.УстановитьПараметр("Должности", МассивДолжностей);
	Запрос.УстановитьПараметр("Организации", МассивОрганизаций);
	Запрос.УстановитьПараметр("ПодразделенияОрганизаций", МассивПодразделенийОрганизаций);
	Запрос.УстановитьПараметр("ПодразделенияПредприятия", МассивПодразделенийПредприятия);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если МассивПользователей.Найти(ВыборкаДетальныеЗаписи.Пользователь) = Неопределено Тогда
			МассивПользователей.Добавить(ВыборкаДетальныеЗаписи.Пользователь);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивПользователей;
	
КонецФункции

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(НаполнениеБиблиотеки, ДополнительныеДанные=Неопределено) Экспорт
	

	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем пользователей, библиотека, которых наполняется этим документом
	//
	
	МассивПользователей = ПользователиДокумента(НаполнениеБиблиотеки);
			
	Если ДополнительныеДанные <> Неопределено И
		ТипЗнч(ДополнительныеДанные) = Тип("Структура") И
		ДополнительныеДанные.Свойство("ПользователиДоЗаписи") Тогда
		
		Для каждого Пользователь Из ДополнительныеДанные.ПользователиДоЗаписи Цикл
		
			Если МассивПользователей.Найти(Пользователь) = Неопределено Тогда
				МассивПользователей.Добавить(Пользователь);	
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	// Формируем библиотеку каждого пользователя целиком
	//
	
	Для каждого Пользователь Из МассивПользователей Цикл
		РегистрыСведений.БиблиотекаПользователейСУО.ОбновитьДанныеВебКабинета(Пользователь);
	КонецЦикла;	
	
	// Зависимости
	//
	
	// Зависимость от элементов библиотеки не требуется,
	// Так как эти зависимости заполняются в разрезе пользователей
	// В регистре БиблиотекаПользователейСУО
	

	
КонецПроцедуры
